import { generateAllowedRange } from '../generators';

test('персонаж у левой границы поля, радиус хода 3', () => {
  const expected = [
    [16, 24, 32, 40, 48, 56, 64],
    [17, 25, 33, 41, 49, 57, 65],
    [18, 26, 34, 42, 50, 58, 66],
    [19, 27, 35, 43, 51, 59, 67],
    [20, 28, 36, 44, 52, 60, 68],
  ];

  expect(generateAllowedRange(41, 3, 8)).toEqual(expected);
});

test('персонаж у правой границы поля, радиус хода 4', () => {
  const expected = [
    [-6, 2, 10, 18, 26, 34, 42, 50, 58],
    [-5, 3, 11, 19, 27, 35, 43, 51, 59],
    [-4, 4, 12, 20, 28, 36, 44, 52, 60],
    [-3, 5, 13, 21, 29, 37, 45, 53, 61],
    [-2, 6, 14, 22, 30, 38, 46, 54, 62],
    [-1, 7, 15, 23, 31, 39, 47, 55, 63],
  ];

  expect(generateAllowedRange(30, 4, 8)).toEqual(expected);
});

test('персонаж по центру поля, радиус хода 2', () => {
  const expected = [
    [17, 25, 33, 41, 49],
    [18, 26, 34, 42, 50],
    [19, 27, 35, 43, 51],
    [20, 28, 36, 44, 52],
    [21, 29, 37, 45, 53],
  ];

  expect(generateAllowedRange(35, 2, 8)).toEqual(expected);
});
